## Pandas

# 1. 데이터프레임 샘플 생성

#### 1.1 라이브러리 임포트

In [1]:
import pandas as pd
import numpy as np

#### 1.2 난수생성

In [2]:
# np.random.randint : 균일 분포의 정수 난수 1개 생성
# np.random.rand : 0부터 1사이의 균일 분포에서 난수 matrix array 생성
# np.random.randn : 가우시안 표준 정규 분포에서 난수 matrix array 생성

data = np.random.randn(6, 4)
data

array([[-0.90615424, -0.95032231,  1.43175578, -2.01924133],
       [ 1.35536654, -0.09068727, -0.5062242 ,  0.89612862],
       [ 0.24469082,  1.04251776,  0.46821291,  0.64039505],
       [ 0.2914245 ,  0.74270602, -0.35224784,  0.50859126],
       [ 0.47098147,  0.44838571, -3.94119266, -0.02574679],
       [ 1.20911833, -0.58158543,  1.08425121, -0.29692707]])

#### 1.3 날짜 생성

In [3]:
dates = pd.date_range("20220101", periods=6)
dates

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

#### 1.4 데이터 프레임 생성
- 데이터 : 난수  행렬(6x4)
- 인덱스 : 날짜 (6X1)
- 칼럼 : A,B,C,D (1X4)

In [5]:
df = pd.DataFrame(data, index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241
2022-01-02  1.355367 -0.090687 -0.506224  0.896129
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-04  0.291425  0.742706 -0.352248  0.508591
2022-01-05  0.470981  0.448386 -3.941193 -0.025747
2022-01-06  1.209118 -0.581585  1.084251 -0.296927

---

# 2. 데이터 전처리

## 2.1 데이터프레임 정보 탐색
- df.head()
- df.tail()
- df.info
- df.describe()

In [6]:
df.head()

                   A         B         C         D
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241
2022-01-02  1.355367 -0.090687 -0.506224  0.896129
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-04  0.291425  0.742706 -0.352248  0.508591
2022-01-05  0.470981  0.448386 -3.941193 -0.025747

In [7]:
df.tail()

                   A         B         C         D
2022-01-02  1.355367 -0.090687 -0.506224  0.896129
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-04  0.291425  0.742706 -0.352248  0.508591
2022-01-05  0.470981  0.448386 -3.941193 -0.025747
2022-01-06  1.209118 -0.581585  1.084251 -0.296927

In [8]:
# 데이터프레임의 기본 정보
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2022-01-01 to 2022-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [9]:
# 데이터프레임의 기술통계 정보 확인
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.444238  0.101836 -0.302574 -0.049467
std    0.812729  0.778057  1.939525  1.060500
min   -0.906154 -0.950322 -3.941193 -2.019241
25%    0.256374 -0.458861 -0.467730 -0.229132
50%    0.381203  0.178849  0.057983  0.241422
75%    1.024584  0.669126  0.930242  0.607444
max    1.355367  1.042518  1.431756  0.896129

In [10]:
df.index

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

---

## 2.2 데이터 선택하기

In [12]:
df = pd.DataFrame(data, index=dates, columns=["A", "B", "C", "D"]) 
df

                   A         B         C         D
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241
2022-01-02  1.355367 -0.090687 -0.506224  0.896129
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-04  0.291425  0.742706 -0.352248  0.508591
2022-01-05  0.470981  0.448386 -3.941193 -0.025747
2022-01-06  1.209118 -0.581585  1.084251 -0.296927

### 2.2.1 열 선택하기

In [13]:
# 한 개 컬럼 선택
df['A']

2022-01-01   -0.906154
2022-01-02    1.355367
2022-01-03    0.244691
2022-01-04    0.291425
2022-01-05    0.470981
2022-01-06    1.209118
Freq: D, Name: A, dtype: float64

In [14]:
df.A

2022-01-01   -0.906154
2022-01-02    1.355367
2022-01-03    0.244691
2022-01-04    0.291425
2022-01-05    0.470981
2022-01-06    1.209118
Freq: D, Name: A, dtype: float64

In [15]:
type(df['A'])

pandas.core.series.Series

In [16]:
df[['A']]

                   A
2022-01-01 -0.906154
2022-01-02  1.355367
2022-01-03  0.244691
2022-01-04  0.291425
2022-01-05  0.470981
2022-01-06  1.209118

In [17]:
type(df[['A']])

pandas.core.frame.DataFrame

In [18]:
df['A','B']

KeyError: ('A', 'B')

In [19]:
df[['A','B']]

                   A         B
2022-01-01 -0.906154 -0.950322
2022-01-02  1.355367 -0.090687
2022-01-03  0.244691  1.042518
2022-01-04  0.291425  0.742706
2022-01-05  0.470981  0.448386
2022-01-06  1.209118 -0.581585

### 2.2.2 행 선택하기

In [20]:
df.loc['20220101']

A   -0.906154
B   -0.950322
C    1.431756
D   -2.019241
Name: 2022-01-01 00:00:00, dtype: float64

### 2.2.3 offset index
- [n:m] : n부터 m-1 까지 
- 인덱스나 컬럼의 이름으로 slice 하는 경우는 끝을 포함한다

#### 2.2.3.1 case1 `df[ : ]`

In [21]:
df[:]

                   A         B         C         D
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241
2022-01-02  1.355367 -0.090687 -0.506224  0.896129
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-04  0.291425  0.742706 -0.352248  0.508591
2022-01-05  0.470981  0.448386 -3.941193 -0.025747
2022-01-06  1.209118 -0.581585  1.084251 -0.296927

In [22]:
df[0:3]

                   A         B         C         D
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241
2022-01-02  1.355367 -0.090687 -0.506224  0.896129
2022-01-03  0.244691  1.042518  0.468213  0.640395

In [23]:
df["20220101":"20220104"]

                   A         B         C         D
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241
2022-01-02  1.355367 -0.090687 -0.506224  0.896129
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-04  0.291425  0.742706 -0.352248  0.508591

#### 2.2.3.1 case2 `df.loc[]`

In [24]:
df.loc[:,:]

                   A         B         C         D
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241
2022-01-02  1.355367 -0.090687 -0.506224  0.896129
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-04  0.291425  0.742706 -0.352248  0.508591
2022-01-05  0.470981  0.448386 -3.941193 -0.025747
2022-01-06  1.209118 -0.581585  1.084251 -0.296927

In [25]:
df.loc['20220103':'20220106', 'B':'D']

                   B         C         D
2022-01-03  1.042518  0.468213  0.640395
2022-01-04  0.742706 -0.352248  0.508591
2022-01-05  0.448386 -3.941193 -0.025747
2022-01-06 -0.581585  1.084251 -0.296927

In [26]:
df.loc['20220103':'20220106', ['B','D']]

                   B         D
2022-01-03  1.042518  0.640395
2022-01-04  0.742706  0.508591
2022-01-05  0.448386 -0.025747
2022-01-06 -0.581585 -0.296927

In [27]:
df.loc[['20220103','20220106'], 'B':'D']

                   B         C         D
2022-01-03  1.042518  0.468213  0.640395
2022-01-06 -0.581585  1.084251 -0.296927

In [28]:
df.loc[['20220103','20220106'], ['B','D']]

                   B         D
2022-01-03  1.042518  0.640395
2022-01-06 -0.581585 -0.296927

In [29]:
df.loc["20220527":"20220530", ['A','C']]

Empty DataFrame
Columns: [A, C]
Index: []

In [30]:
df.loc['20220103', 'C']

0.46821291387363906

### 2.2.4 특정 위치의 값 선택하기 `df.loc[]`

In [31]:
df.at['20220103', 'C']

0.46821291387363906

### 2.2.4 인덱스 번호로 선택하기 `df.iloc[]`

- iloc : inter location 
    - 컴퓨터가 인식하는 인덱스 값으로 선택

In [32]:
df

                   A         B         C         D
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241
2022-01-02  1.355367 -0.090687 -0.506224  0.896129
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-04  0.291425  0.742706 -0.352248  0.508591
2022-01-05  0.470981  0.448386 -3.941193 -0.025747
2022-01-06  1.209118 -0.581585  1.084251 -0.296927

In [33]:
df.iloc[3]

A    0.291425
B    0.742706
C   -0.352248
D    0.508591
Name: 2022-01-04 00:00:00, dtype: float64

In [34]:
df.iloc[3,1]

0.7427060171136484

In [35]:
df.iloc[0:3, 0:3]

                   A         B         C
2022-01-01 -0.906154 -0.950322  1.431756
2022-01-02  1.355367 -0.090687 -0.506224
2022-01-03  0.244691  1.042518  0.468213

In [36]:
df.iloc[2,[0,2]]

A    0.244691
C    0.468213
Name: 2022-01-03 00:00:00, dtype: float64

In [37]:
df.iloc[:,[0,2]]

                   A         C
2022-01-01 -0.906154  1.431756
2022-01-02  1.355367 -0.506224
2022-01-03  0.244691  0.468213
2022-01-04  0.291425 -0.352248
2022-01-05  0.470981 -3.941193
2022-01-06  1.209118  1.084251

In [38]:
df.iloc[[0,2], 2]

2022-01-01    1.431756
2022-01-03    0.468213
Freq: 2D, Name: C, dtype: float64

In [39]:
df.iloc[[0,2], :]

                   A         B         C         D
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241
2022-01-03  0.244691  1.042518  0.468213  0.640395

---

## 2.3 데이터 정렬

In [40]:
# 오름차순

df.sort_values(by='A', inplace=True)
df

                   A         B         C         D
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-04  0.291425  0.742706 -0.352248  0.508591
2022-01-05  0.470981  0.448386 -3.941193 -0.025747
2022-01-06  1.209118 -0.581585  1.084251 -0.296927
2022-01-02  1.355367 -0.090687 -0.506224  0.896129

In [41]:
# 내림차순

df.sort_values(by='A', ascending=False, inplace=True)
df

                   A         B         C         D
2022-01-02  1.355367 -0.090687 -0.506224  0.896129
2022-01-06  1.209118 -0.581585  1.084251 -0.296927
2022-01-05  0.470981  0.448386 -3.941193 -0.025747
2022-01-04  0.291425  0.742706 -0.352248  0.508591
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241

In [42]:
# 원상복구

df = pd.DataFrame(data, index=dates, columns=["A", "B", "C", "D"]) 
df

                   A         B         C         D
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241
2022-01-02  1.355367 -0.090687 -0.506224  0.896129
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-04  0.291425  0.742706 -0.352248  0.508591
2022-01-05  0.470981  0.448386 -3.941193 -0.025747
2022-01-06  1.209118 -0.581585  1.084251 -0.296927

---

## 2.4 condition

### 2.4.1 마스킹

In [43]:
df

                   A         B         C         D
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241
2022-01-02  1.355367 -0.090687 -0.506224  0.896129
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-04  0.291425  0.742706 -0.352248  0.508591
2022-01-05  0.470981  0.448386 -3.941193 -0.025747
2022-01-06  1.209118 -0.581585  1.084251 -0.296927

In [44]:
# 양수만 선택

df['A'] > 0

2022-01-01    False
2022-01-02     True
2022-01-03     True
2022-01-04     True
2022-01-05     True
2022-01-06     True
Freq: D, Name: A, dtype: bool

In [45]:
df[['A','B']] > 0

                A      B
2022-01-01  False  False
2022-01-02   True  False
2022-01-03   True   True
2022-01-04   True   True
2022-01-05   True   True
2022-01-06   True  False

In [46]:
# 마스킹
df[df[['A','B']] > 0]

                   A         B   C   D
2022-01-01       NaN       NaN NaN NaN
2022-01-02  1.355367       NaN NaN NaN
2022-01-03  0.244691  1.042518 NaN NaN
2022-01-04  0.291425  0.742706 NaN NaN
2022-01-05  0.470981  0.448386 NaN NaN
2022-01-06  1.209118       NaN NaN NaN

In [47]:
# NaN : Not a Number

df[df > 0]

                   A         B         C         D
2022-01-01       NaN       NaN  1.431756       NaN
2022-01-02  1.355367       NaN       NaN  0.896129
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-04  0.291425  0.742706       NaN  0.508591
2022-01-05  0.470981  0.448386       NaN       NaN
2022-01-06  1.209118       NaN  1.084251       NaN

### 2.4.2 isin()

- isin() : 특정 요소가 있는지 확인

In [48]:
df['E'] = ['one', 'one', 'two', 'three', 'four', 'seven']
df

                   A         B         C         D      E
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241    one
2022-01-02  1.355367 -0.090687 -0.506224  0.896129    one
2022-01-03  0.244691  1.042518  0.468213  0.640395    two
2022-01-04  0.291425  0.742706 -0.352248  0.508591  three
2022-01-05  0.470981  0.448386 -3.941193 -0.025747   four
2022-01-06  1.209118 -0.581585  1.084251 -0.296927  seven

In [49]:
df['E'].isin(["two"])

2022-01-01    False
2022-01-02    False
2022-01-03     True
2022-01-04    False
2022-01-05    False
2022-01-06    False
Freq: D, Name: E, dtype: bool

In [50]:
df['E'].isin(["two", "seven"])

2022-01-01    False
2022-01-02    False
2022-01-03     True
2022-01-04    False
2022-01-05    False
2022-01-06     True
Freq: D, Name: E, dtype: bool

In [51]:
# 마스킹
df[df['E'].isin(["two", "seven"])]

                   A         B         C         D      E
2022-01-03  0.244691  1.042518  0.468213  0.640395    two
2022-01-06  1.209118 -0.581585  1.084251 -0.296927  seven

### 2.4.3 str.contains()

In [52]:
df

                   A         B         C         D      E
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241    one
2022-01-02  1.355367 -0.090687 -0.506224  0.896129    one
2022-01-03  0.244691  1.042518  0.468213  0.640395    two
2022-01-04  0.291425  0.742706 -0.352248  0.508591  three
2022-01-05  0.470981  0.448386 -3.941193 -0.025747   four
2022-01-06  1.209118 -0.581585  1.084251 -0.296927  seven

In [53]:
df['E'].str.contains('one')

2022-01-01     True
2022-01-02     True
2022-01-03    False
2022-01-04    False
2022-01-05    False
2022-01-06    False
Freq: D, Name: E, dtype: bool

In [54]:
sum(df['E'].str.contains('one'))

2

In [55]:
df['E'].value_counts()

one      2
four     1
seven    1
three    1
two      1
Name: E, dtype: int64

In [56]:
df.loc[df['E'].str.contains('one'), :]

                   A         B         C         D    E
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241  one
2022-01-02  1.355367 -0.090687 -0.506224  0.896129  one

In [57]:
# 원상복구

del df['E']
df

                   A         B         C         D
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241
2022-01-02  1.355367 -0.090687 -0.506224  0.896129
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-04  0.291425  0.742706 -0.352248  0.508591
2022-01-05  0.470981  0.448386 -3.941193 -0.025747
2022-01-06  1.209118 -0.581585  1.084251 -0.296927

---

## 2.5 만들기

#### 2.5.1 컬럼 만들기

In [58]:
df

                   A         B         C         D
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241
2022-01-02  1.355367 -0.090687 -0.506224  0.896129
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-04  0.291425  0.742706 -0.352248  0.508591
2022-01-05  0.470981  0.448386 -3.941193 -0.025747
2022-01-06  1.209118 -0.581585  1.084251 -0.296927

In [59]:
# 기존 칼럼이 없으면 추가
# 기존 칼럼이 있으면 수정

df['E'] = ['one', 'one', 'two', 'three', 'four', 'seven']
df

                   A         B         C         D      E
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241    one
2022-01-02  1.355367 -0.090687 -0.506224  0.896129    one
2022-01-03  0.244691  1.042518  0.468213  0.640395    two
2022-01-04  0.291425  0.742706 -0.352248  0.508591  three
2022-01-05  0.470981  0.448386 -3.941193 -0.025747   four
2022-01-06  1.209118 -0.581585  1.084251 -0.296927  seven

#### 2.5.2 `apply`

In [60]:
# 덧셈
df['A'].apply('sum')

2.6654274283279564

In [61]:
# 중앙값
df['A'].apply('mean')

0.44423790472132607

In [62]:
# 표준편차
df['A'].apply('std')

0.8127290583357278

In [63]:
# 최솟값
df['A'].apply('min')

-0.9061542433604323

In [64]:
# 최댓값
df['A'].apply('max')

1.355366544790405

In [65]:
df['A'].apply(np.sum)

2022-01-01   -0.906154
2022-01-02    1.355367
2022-01-03    0.244691
2022-01-04    0.291425
2022-01-05    0.470981
2022-01-06    1.209118
Freq: D, Name: A, dtype: float64

In [66]:
df['A'].apply(np.mean)

2022-01-01   -0.906154
2022-01-02    1.355367
2022-01-03    0.244691
2022-01-04    0.291425
2022-01-05    0.470981
2022-01-06    1.209118
Freq: D, Name: A, dtype: float64

In [67]:
df['A'].apply(np.std)

2022-01-01    0.0
2022-01-02    0.0
2022-01-03    0.0
2022-01-04    0.0
2022-01-05    0.0
2022-01-06    0.0
Freq: D, Name: A, dtype: float64

In [68]:
df.apply(np.min)

A   -0.906154
B   -0.950322
C   -3.941193
D   -2.019241
E        four
dtype: object

In [69]:
df.apply(np.max)

A    1.355367
B    1.042518
C    1.431756
D    0.896129
E         two
dtype: object

In [70]:
# 함수를 만들어서 적용시킬 수 잇음
def plusminus(num):
    return "plus" if num>0  else "minus"

df['A'].apply(plusminus)

2022-01-01    minus
2022-01-02     plus
2022-01-03     plus
2022-01-04     plus
2022-01-05     plus
2022-01-06     plus
Freq: D, Name: A, dtype: object

In [71]:
# 람다로 표현을 더 간결하게 할 수 있음
df["A"].apply(lambda num: "plus" if num > 0 else "minus")

2022-01-01    minus
2022-01-02     plus
2022-01-03     plus
2022-01-04     plus
2022-01-05     plus
2022-01-06     plus
Freq: D, Name: A, dtype: object

In [72]:
# 여러 열을 동시에 함수 적용
df[['A','D']].apply('sum')

A    2.665427
D   -0.296800
dtype: float64

---

## 2.6 칼럼 제거
- del
- drop

In [73]:
df

                   A         B         C         D      E
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241    one
2022-01-02  1.355367 -0.090687 -0.506224  0.896129    one
2022-01-03  0.244691  1.042518  0.468213  0.640395    two
2022-01-04  0.291425  0.742706 -0.352248  0.508591  three
2022-01-05  0.470981  0.448386 -3.941193 -0.025747   four
2022-01-06  1.209118 -0.581585  1.084251 -0.296927  seven

In [74]:
del df['E']
df

                   A         B         C         D
2022-01-01 -0.906154 -0.950322  1.431756 -2.019241
2022-01-02  1.355367 -0.090687 -0.506224  0.896129
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-04  0.291425  0.742706 -0.352248  0.508591
2022-01-05  0.470981  0.448386 -3.941193 -0.025747
2022-01-06  1.209118 -0.581585  1.084251 -0.296927

In [75]:
# axis = 0 가로
# axis = 1 세로
# inplace = True : 덮어쓰기 여부

df.drop(['D'], axis=1)

                   A         B         C
2022-01-01 -0.906154 -0.950322  1.431756
2022-01-02  1.355367 -0.090687 -0.506224
2022-01-03  0.244691  1.042518  0.468213
2022-01-04  0.291425  0.742706 -0.352248
2022-01-05  0.470981  0.448386 -3.941193
2022-01-06  1.209118 -0.581585  1.084251

In [76]:
df.index[0]

Timestamp('2022-01-01 00:00:00', freq='D')

In [100]:
# axis = 0이 기본 설정값
df.drop([df.index[0]])

                   A         B         C         D
2022-01-02  1.355367 -0.090687 -0.506224  0.896129
2022-01-03  0.244691  1.042518  0.468213  0.640395
2022-01-04  0.291425  0.742706 -0.352248  0.508591
2022-01-05  0.470981  0.448386 -3.941193 -0.025747
2022-01-06  1.209118 -0.581585  1.084251 -0.296927

---

# 3. 두 데이터 합치기
- pd.merge()
- pd.join()
- pd.concat()

## 3.1 데이터 프레임 생성

In [92]:
# 딕셔너리 안에 리스트 형태 (열방향)

left = pd.DataFrame({
        'key': ['K0', 'K4', 'K2', 'K3'],
        'A': ['A0','A1','A2','A3'],
        'B': ['B0','B1','B2','B3']
})

left

  key   A   B
0  K0  A0  B0
1  K4  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [93]:
# 리스트 안에 딕셔너리 형태 (행방향)

right = pd.DataFrame([
    {'key':'K0', 'C':'C0', 'D':'D0'},
    {'key':'K1', 'C':'C1', 'D':'D1'},
    {'key':'K2', 'C':'C2', 'D':'D2'},
    {'key':'K3', 'C':'C3', 'D':'D3'}
])

right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

### 3.2 pd.merge()
- 두 데이터프레임에서 컬럼이나 인덱스를 기준으로 잡고 병합
- 기준이 되는 커럼이나 인덱스를 키값이라고 한다
- 기준이 되는 키값은 두 데이터프레임에 모두 포함되어 있어야 한다

In [95]:
# 'key'값을 기준으로 데이터 병합
# 공통된 데이터가 있는 부분만 병합
# how ='inner'가 기본 설정값 (교집합)

pd.merge(left,right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [97]:
# 왼쪽에 있는 데이터프레임 기준으로 데이터를 병합
# 오른쪽 데이터프레임에 해당 값이 없으면 NaN으로 표기

pd.merge(left,right, how='left', on='key')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K4  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [99]:
# 오른쪽에 있는 데이터프레임 기준으로 데이터를 병합
# 왼쪽 데이터프레임에 해당 값이 없으면 NaN으로 표기

pd.merge(left,right, how='right', on='key')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1  NaN  NaN  C1  D1
2  K2   A2   B2  C2  D2
3  K3   A3   B3  C3  D3

In [101]:
# 합집합

pd.merge(left,right, how='outer', on='key')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1

### 3.3 pd.join()
- A.join(B)
- A, B의 기준열 순서가 맞지 않아도 매칭이 됨
- 단, A와 B 데이터프레임의 index열의 길이가 동일해야 함
- 열 이름이 중복되지 않도록 주의

In [105]:
A = pd.DataFrame({
        'key': ['K0', 'K4', 'K2', 'K3'],
        'A': ['A0','A1','A2','A3'],
        'B': ['B0','B1','B2','B3']
})

A

  key   A   B
0  K0  A0  B0
1  K4  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [109]:
B = pd.DataFrame([
    {'C':'C0', 'D':'D0'},
    {'C':'C1', 'D':'D1'},
    {'C':'C2', 'D':'D2'},
    {'C':'C3', 'D':'D3'}
])

B

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [110]:
A.join(B)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K4  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [111]:
B.join(A)

    C   D key   A   B
0  C0  D0  K0  A0  B0
1  C1  D1  K4  A1  B1
2  C2  D2  K2  A2  B2
3  C3  D3  K3  A3  B3

### 3.3 pd.concat()
- pd.concat([df_1,df_2], axis=0)
- axis = 0 : 행방향
- axis = 1 : 열방향

In [114]:
df_1 = pd.DataFrame({
        'key': ['K0', 'K4', 'K2', 'K3'],
        'A': ['A0','A1','A2','A3'],
        'B': ['B0','B1','B2','B3']
})

df_1

  key   A   B
0  K0  A0  B0
1  K4  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [115]:
df_2 = pd.DataFrame([
    {'key':'K0', 'C':'C0', 'D':'D0'},
    {'key':'K1', 'C':'C1', 'D':'D1'},
    {'key':'K2', 'C':'C2', 'D':'D2'},
    {'key':'K3', 'C':'C3', 'D':'D3'}
])

df_2

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [116]:
# 행방향으로 병합
pd.concat([df_1, df_2], axis = 0)

  key    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3  NaN  NaN
0  K0  NaN  NaN   C0   D0
1  K1  NaN  NaN   C1   D1
2  K2  NaN  NaN   C2   D2
3  K3  NaN  NaN   C3   D3

In [117]:
# 열방향으로 병합
pd.concat([df_1, df_2], axis = 1)

  key   A   B key   C   D
0  K0  A0  B0  K0  C0  D0
1  K4  A1  B1  K1  C1  D1
2  K2  A2  B2  K2  C2  D2
3  K3  A3  B3  K3  C3  D3